
/* Status text shown below token for new Medium accounts when login was successful. */
"AddAccountStatusLoggedIn" = "Signed in successfully!";

/* Status text shown below token for new Medium accounts when login failed. */
"AddAccountStatusError" = "Failed to sign in! Please verify your Integration Token.";

/* Status text shown below token for new Medium accounts when an account is attemped to be added twice. */
"AddAccountStatusDuplicateAccount" = "Account has already been added!";

/* Informative text shown below when adding a new Medium account. Placeholders inserts link URL.  */
"AddAccountInfomativeText" = "You can get an Integration Token at the bottom of the %@Settings page%@ of your Medium account.";


/* Status text shown below token for existing Medium accounts when they are logged in okay. Placeholders inserts link URL.  */
"ViewAccountStatusLoggedIn" = "You can get an Integration Token at the bottom of the %@Settings page%@ of your Medium account.";

/* Status text shown below token for existing Medium accounts when there is a problem with the connection. Placeholders inserts link URL. */
"ViewAccountStatusError" = "There seems to be a problem with your account. Please verify your %@Integration Token%@ and check your internet connection.";


/* Disabled button label indicating the account is currently signed in. */
"ButtonSignedIn" = "Signed In";

/* Enabled button label indicating the data entered for an account allows a signin attempt. */
"ButtonSignIn" = "Sign In";
